var_int = 10
var_float = 8.4
var_str = 'No'

var_big = int(float(var_int) * 3.5)
print(var_big)

var_float -= 1
print(var_float)

print(var_int/var_float, var_big/var_float)

var_str = f'{var_str * 2}' + f'{"Yes" * 3}'
print(var_str)

# Завдання 1
#
# Змінній var_int привласніть
# значення 10, var_float – значення 8.4, var_str –
# "No".
#
# Значення, яке зберігається в змінній var_int,
# збільште у 3.5 рази. Отриманий результат зв'яжіть зі змінною
# var_big.
#
# Змініть значення, яке зберігається в змінній
# var_float, зменшивши його на одиницю, зв'яжіть результат з тієї ж
# змінної.
#
# Розділіть var_int на var_float, а потім
# var_big на var_float. Результат цих виразів не прив'язуйте ні до
# яким змінним.
#
# Змініть значення змінної var_str на
# "NoNoYesYesYes". При формуванні нового значення використовуйте операції
# конкатенації (+) та повторення рядка (*).
#
# Виведіть значення всіх змінних.
